app/controllers/addrecipe_controller.rb

INSERT INTO "recipes" ("title", "ingredients", "instructions", "cooking_time", "servings", "difficulty", "created_at", "updated_at", "image_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
      recipe = Recipe.new(recipe_params)
      if recipe.save