app/controllers/liked_controller.rb

    def index
      @liked_recipes = current_user.liked_recipes.includes(:recipe)

      respond_to do |format|
        format.html { render :liked } # renders liked.html.erb
        format.json { render json: @liked_recipes.map { |lr| lr.recipe } }
---
SELECT "liked_recipes".* FROM "liked_recipes" WHERE "liked_recipes"."user_id" = ?  [["user_id", 2]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" IN (?, ?)  [["id", 56], ["id", 57]]

    def create
      recipe = Recipe.find(params[:recipe_id])
      if current_user.liked_recipes.find_by(recipe: recipe)
        render json: { message: 'Recipe already liked', recipe_id: recipe.id }, status: :unprocessable_entity
        return
      end

      liked_recipe = current_user.liked_recipes.build(recipe: recipe)

      if liked_recipe.save
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 56], ["LIMIT", 1]]
SELECT "liked_recipes".* FROM "liked_recipes" WHERE "liked_recipes"."user_id" = ? AND "liked_recipes"."recipe_id" = ? LIMIT ?  [["user_id", 2], ["recipe_id", 63], ["LIMIT", 1]]
INSERT INTO "recipes" ("title", "ingredients", "instructions", "cooking_time", "servings", "difficulty", "created_at", "updated_at", "image_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
INSERT INTO "liked_recipes" ("user_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?) RETURNING "id"  [["user_id", 2], ["recipe_id", 63], ["created_at", "2024-11-04 03:22:51.871922"], ["updated_at", "2024-11-04 03:22:51.871922"]]

    def destroy
      begin
        recipe = Recipe.find(params[:recipe_id])
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT ?  [["id", 56], ["LIMIT", 1]]