app/controllers/swipe_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT "recipes".* FROM "recipes" WHERE NOT ((ingredients LIKE ?))  [[nil, "%Flour%"]]