app/models/recipe.rb

  def self.fetch_new_recipes_from_api(count = 10)
    url = URI("https://www.themealdb.com/api/json/v1/1/random.php")
    recipes = []

    count.times do
      response = Net::HTTP.get(url)
      meal_data = JSON.parse(response)["meals"]&.first # Get the first meal object

      next unless meal_data # Skip if no meal data

      # Fetch all ingredients
      ingredients = (1..20).map do |i|
        ingredient = meal_data["strIngredient#{i}"]
        measure = meal_data["strMeasure#{i}"]
        "#{measure} #{ingredient}".strip if ingredient.present?
      end.compact.join(", ") # Join ingredients into a string

      # Check if the recipe already exists in the database by its unique ID (or title)
      existing_recipe = Recipe.find_by(title: meal_data["strMeal"])

      if existing_recipe
        # If the recipe exists, use the same attributes for cooking_time, servings, and difficulty
        recipes << existing_recipe
---
INSERT INTO "recipes" ("title", "ingredients", "instructions", "cooking_time", "servings", "difficulty", "created_at", "updated_at", "image_url") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"